TMS320C2000 Assembler PC v6.4.4 Tue Feb 14 14:42:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0221343\AppData\Local\Temp\0706410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.4 *
       3              ;* Date/Time created: Tue Feb 14 14:42:54 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/Users/a0221343/Git/bootROM/f28004x_bootrom/F28004x_ROM_dev_PG2.0/F28
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.4 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\a0221343\Git\bootROM\f28004x_bootrom\F28004x_ROM_dev_PG2.0
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("Interrupt_disable")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_Interrupt_disable")

    4529 00000006 0648          MOVL      ACC,*-SP[8]           ; [CPU_] |2521| 
    4530 00000007 CEC4          AND       AL,*+XAR4[0]          ; [CPU_] |2521| 
    4531 00000008 CFCC          AND       AH,*+XAR4[1]          ; [CPU_] |2521| 
    4532 00000009 FF58          TEST      ACC                   ; [CPU_] |2521| 
    4533 0000000a EC03          BF        $C$L109,EQ            ; [CPU_] |2521| 
    4534                      ; branchcc occurs ; [] |2521| 
    4535                      .dwpsn  file "C:/Users/a0221343/Git/bootROM/f28004x_bootrom/F28004x_ROM_dev_PG2.0/F28004x_ROM/driverl
    4536 0000000b 56BF          MOVB      *-SP[3],#1,UNC        ; [CPU_] |2523| 
         0000000c 0143 
    4537 0000000d       $C$L109:    
    4538                      .dwpsn  file "C:/Users/a0221343/Git/bootROM/f28004x_bootrom/F28004x_ROM_dev_PG2.0/F28004x_ROM/driverl
    4539 0000000d 9243          MOV       AL,*-SP[3]            ; [CPU_] |2526| 
    4540                      .dwpsn  file "C:/Users/a0221343/Git/bootROM/f28004x_bootrom/F28004x_ROM_dev_PG2.0/F28004x_ROM/driverl
    4541 0000000e FE84          SUBB      SP,#4                 ; [CPU_U] 
    4542                      .dwcfi  cfa_offset, -2
    4543              $C$DW$280       .dwtag  DW_TAG_TI_branch
    4544                      .dwattr $C$DW$280, DW_AT_low_pc(0x00)
    4545                      .dwattr $C$DW$280, DW_AT_TI_return
    4546 0000000f 0006          LRETR     ; [CPU_] 
    4547                      ; return occurs ; [] 
    4548                      .dwattr $C$DW$275, DW_AT_TI_end_file("C:/Users/a0221343/Git/bootROM/f28004x_bootrom/F28004x_ROM_dev_P
    4549                      .dwattr $C$DW$275, DW_AT_TI_end_line(0x9df)
    4550                      .dwattr $C$DW$275, DW_AT_TI_end_column(0x01)
    4551                      .dwendentry
    4552                      .dwendtag $C$DW$275
    4553              
    4554              ;**************************************************************
    4555              ;* UNDEFINED EXTERNAL REFERENCES                              *
    4556              ;**************************************************************
    4557                      .global _Interrupt_disable
    4558                      .global _Interrupt_enable
    4559              
    4560              ;***************************************************************
    4561              ;* TYPE INFORMATION                                            *
    4562              ;***************************************************************
    4563              
    4564              $C$DW$T$24      .dwtag  DW_TAG_enumeration_type
    4565                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    4566              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("CAN_INT_STS_CAUSE"), DW_AT_const_value(0x00)
    4567              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("CAN_INT_STS_OBJECT"), DW_AT_const_value(0x01)
    4568                      .dwendtag $C$DW$T$24
    4569              
    4570              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("CAN_IntStatusReg")
    4571                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    4572                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.4.4 Tue Feb 14 14:42:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0221343\AppData\Local\Temp\0706410                         PAGE   88

    4573              
    4574              $C$DW$T$26      .dwtag  DW_TAG_enumeration_type
    4575                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    4576              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("CAN_STS_CONTROL"), DW_AT_const_value(0x00)
    4577              $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("CAN_STS_TXREQUEST"), DW_AT_const_value(0x01)
    4578              $C$DW$285       .dwtag  DW_TAG_enumerator, DW_AT_name("CAN_STS_NEWDAT"), DW_AT_const_value(0x02)
    4579              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("CAN_STS_MSGVAL"), DW_AT_const_value(0x03)
    4580                      .dwendtag $C$DW$T$26
    4581              
    4582              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CAN_StatusReg")
    4583                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    4584                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4585              
    4586              $C$DW$T$28      .dwtag  DW_TAG_enumeration_type
    4587                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    4588              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("MSG_OBJ_TYPE_TX"), DW_AT_const_value(0x00)
    4589              $C$DW$288       .dwtag  DW_TAG_enumerator, DW_AT_name("MSG_OBJ_TYPE_TX_REMOTE"), DW_AT_const_value(0x01)
    4590              $C$DW$289       .dwtag  DW_TAG_enumerator, DW_AT_name("MSG_OBJ_TYPE_RX"), DW_AT_const_value(0x02)
    4591              $C$DW$290       .dwtag  DW_TAG_enumerator, DW_AT_name("MSG_OBJ_TYPE_RX_REMOTE"), DW_AT_const_value(0x03)
    4592              $C$DW$291       .dwtag  DW_TAG_enumerator, DW_AT_name("MSG_OBJ_TYPE_RXTX_REMOTE"), DW_AT_const_value(0x04)
    4593                      .dwendtag $C$DW$T$28
    4594              
    4595              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CAN_MsgObjType")
    4596                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    4597                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    4598              
    4599              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4600                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
    4601              $C$DW$292       .dwtag  DW_TAG_member
    4602                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$19)
    4603                      .dwattr $C$DW$292, DW_AT_name("syncPropPhase1Seg")
    4604                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_syncPropPhase1Seg")
    4605                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4606                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4607              $C$DW$293       .dwtag  DW_TAG_member
    4608                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    4609                      .dwattr $C$DW$293, DW_AT_name("phase2Seg")
    4610                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_phase2Seg")
    4611                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4612                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4613              $C$DW$294       .dwtag  DW_TAG_member
    4614                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    4615                      .dwattr $C$DW$294, DW_AT_name("sjw")
    4616                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_sjw")
    4617                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4618                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4619              $C$DW$295       .dwtag  DW_TAG_member
    4620                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    4621                      .dwattr $C$DW$295, DW_AT_name("quantumPrescaler")
    4622                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_quantumPrescaler")
    4623                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4624                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4625                      .dwendtag $C$DW$T$20
    4626              
    4627              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CAN_BitClkParms")
TMS320C2000 Assembler PC v6.4.4 Tue Feb 14 14:42:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0221343\AppData\Local\Temp\0706410                         PAGE   89

    4628                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$20)
    4629                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    4630              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    4631                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    4632                      .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
    4633              
    4634              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4635                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    4636              $C$DW$296       .dwtag  DW_TAG_member
    4637                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    4638                      .dwattr $C$DW$296, DW_AT_name("msgID")
    4639                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_msgID")
    4640                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4641                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4642              $C$DW$297       .dwtag  DW_TAG_member
    4643                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    4644                      .dwattr $C$DW$297, DW_AT_name("msgIDMask")
    4645                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_msgIDMask")
    4646                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4647                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4648              $C$DW$298       .dwtag  DW_TAG_member
    4649                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    4650                      .dwattr $C$DW$298, DW_AT_name("flags")
    4651                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_flags")
    4652                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4653                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4654              $C$DW$299       .dwtag  DW_TAG_member
    4655                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    4656                      .dwattr $C$DW$299, DW_AT_name("msgLen")
    4657                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_msgLen")
    4658                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4659                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4660              $C$DW$300       .dwtag  DW_TAG_member
    4661                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$22)
    4662                      .dwattr $C$DW$300, DW_AT_name("msgData")
    4663                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_msgData")
    4664                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4665                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4666                      .dwendtag $C$DW$T$23
    4667              
    4668              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CAN_MsgObject")
    4669                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$23)
    4670                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    4671              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    4672                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4673                      .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    4674              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4675                      .dwattr $C$DW$T$2, DW_AT_name("void")
    4676              
    4677              $C$DW$T$34      .dwtag  DW_TAG_subroutine_type
    4678                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4679              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    4680                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4681                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
    4682              $C$DW$T$4       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v6.4.4 Tue Feb 14 14:42:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0221343\AppData\Local\Temp\0706410                         PAGE   90

    4683                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4684                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4685                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4686              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4687                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4688                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4689                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4690              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4691                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4692                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4693                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4694              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4695                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4696                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4697                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4698              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4699                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4700                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4701                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4702              $C$DW$T$9       .dwtag  DW_TAG_base_type
    4703                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4704                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4705                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    4706              $C$DW$T$10      .dwtag  DW_TAG_base_type
    4707                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4708                      .dwattr $C$DW$T$10, DW_AT_name("int")
    4709                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    4710              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    4711                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$10)
    4712                      .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
    4713              $C$DW$T$11      .dwtag  DW_TAG_base_type
    4714                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4715                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4716                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
