TMS320C2000 Assembler PC v6.2.9 Tue Jun 09 22:28:35 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0541610                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.9 *
       3              ;* Date/Time created: Tue Jun 09 22:28:31 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/c2000_bootROM/f28004x_bootrom/F28004x_ROM_dev/F28004x_RO
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.9 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\c2000_bootROM\f28004x_bootrom\F28004x_ROM_dev\ccs_fi
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("Interrupt_disable")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_Interrupt_disable")

    4562 00000007 0648          MOVL      ACC,*-SP[8]           ; [CPU_] |2521| 
    4563 00000008 CEC4          AND       AL,*+XAR4[0]          ; [CPU_] |2521| 
    4564 00000009 CFCC          AND       AH,*+XAR4[1]          ; [CPU_] |2521| 
    4565 0000000a 0FA6          CMPL      ACC,XAR6              ; [CPU_] |2521| 
    4566 0000000b EC03          BF        $C$L109,EQ            ; [CPU_] |2521| 
    4567                      ; branchcc occurs ; [] |2521| 
    4568                      .dwpsn  file "C:/work/grepos/c2000_bootROM/f28004x_bootrom/F28004x_ROM_dev/F28004x_ROM/driverlib/can_
    4569 0000000c 56BF          MOVB      *-SP[3],#1,UNC        ; [CPU_] |2523| 
         0000000d 0143 
    4570 0000000e       $C$L109:    
    4571                      .dwpsn  file "C:/work/grepos/c2000_bootROM/f28004x_bootrom/F28004x_ROM_dev/F28004x_ROM/driverlib/can_
    4572 0000000e 9243          MOV       AL,*-SP[3]            ; [CPU_] |2526| 
    4573                      .dwpsn  file "C:/work/grepos/c2000_bootROM/f28004x_bootrom/F28004x_ROM_dev/F28004x_ROM/driverlib/can_
    4574 0000000f FE84          SUBB      SP,#4                 ; [CPU_U] 
    4575                      .dwcfi  cfa_offset, -2
    4576              $C$DW$280       .dwtag  DW_TAG_TI_branch
    4577                      .dwattr $C$DW$280, DW_AT_low_pc(0x00)
    4578                      .dwattr $C$DW$280, DW_AT_TI_return
    4579 00000010 0006          LRETR     ; [CPU_] 
    4580                      ; return occurs ; [] 
    4581                      .dwattr $C$DW$275, DW_AT_TI_end_file("C:/work/grepos/c2000_bootROM/f28004x_bootrom/F28004x_ROM_dev/F2
    4582                      .dwattr $C$DW$275, DW_AT_TI_end_line(0x9df)
    4583                      .dwattr $C$DW$275, DW_AT_TI_end_column(0x01)
    4584                      .dwendentry
    4585                      .dwendtag $C$DW$275
TMS320C2000 Assembler PC v6.2.9 Tue Jun 09 22:28:35 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0541610                         PAGE   88

    4586              
    4587              ;**************************************************************
    4588              ;* UNDEFINED EXTERNAL REFERENCES                              *
    4589              ;**************************************************************
    4590                      .global _Interrupt_disable
    4591                      .global _Interrupt_enable
    4592              
    4593              ;***************************************************************
    4594              ;* TYPE INFORMATION                                            *
    4595              ;***************************************************************
    4596              
    4597              $C$DW$T$24      .dwtag  DW_TAG_enumeration_type
    4598                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    4599              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("CAN_INT_STS_CAUSE"), DW_AT_const_value(0x00)
    4600              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("CAN_INT_STS_OBJECT"), DW_AT_const_value(0x01)
    4601                      .dwendtag $C$DW$T$24
    4602              
    4603              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("CAN_IntStatusReg")
    4604                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    4605                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    4606              
    4607              $C$DW$T$26      .dwtag  DW_TAG_enumeration_type
    4608                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    4609              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("CAN_STS_CONTROL"), DW_AT_const_value(0x00)
    4610              $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("CAN_STS_TXREQUEST"), DW_AT_const_value(0x01)
    4611              $C$DW$285       .dwtag  DW_TAG_enumerator, DW_AT_name("CAN_STS_NEWDAT"), DW_AT_const_value(0x02)
    4612              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("CAN_STS_MSGVAL"), DW_AT_const_value(0x03)
    4613                      .dwendtag $C$DW$T$26
    4614              
    4615              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CAN_StatusReg")
    4616                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    4617                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4618              
    4619              $C$DW$T$28      .dwtag  DW_TAG_enumeration_type
    4620                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    4621              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("MSG_OBJ_TYPE_TX"), DW_AT_const_value(0x00)
    4622              $C$DW$288       .dwtag  DW_TAG_enumerator, DW_AT_name("MSG_OBJ_TYPE_TX_REMOTE"), DW_AT_const_value(0x01)
    4623              $C$DW$289       .dwtag  DW_TAG_enumerator, DW_AT_name("MSG_OBJ_TYPE_RX"), DW_AT_const_value(0x02)
    4624              $C$DW$290       .dwtag  DW_TAG_enumerator, DW_AT_name("MSG_OBJ_TYPE_RX_REMOTE"), DW_AT_const_value(0x03)
    4625              $C$DW$291       .dwtag  DW_TAG_enumerator, DW_AT_name("MSG_OBJ_TYPE_RXTX_REMOTE"), DW_AT_const_value(0x04)
    4626                      .dwendtag $C$DW$T$28
    4627              
    4628              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CAN_MsgObjType")
    4629                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    4630                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    4631              
    4632              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4633                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
    4634              $C$DW$292       .dwtag  DW_TAG_member
    4635                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$19)
    4636                      .dwattr $C$DW$292, DW_AT_name("syncPropPhase1Seg")
    4637                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_syncPropPhase1Seg")
    4638                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4639                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4640              $C$DW$293       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.9 Tue Jun 09 22:28:35 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0541610                         PAGE   89

    4641                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    4642                      .dwattr $C$DW$293, DW_AT_name("phase2Seg")
    4643                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_phase2Seg")
    4644                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4645                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4646              $C$DW$294       .dwtag  DW_TAG_member
    4647                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    4648                      .dwattr $C$DW$294, DW_AT_name("sjw")
    4649                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_sjw")
    4650                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4651                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4652              $C$DW$295       .dwtag  DW_TAG_member
    4653                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    4654                      .dwattr $C$DW$295, DW_AT_name("quantumPrescaler")
    4655                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_quantumPrescaler")
    4656                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4657                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4658                      .dwendtag $C$DW$T$20
    4659              
    4660              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CAN_BitClkParms")
    4661                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$20)
    4662                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    4663              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    4664                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    4665                      .dwattr $C$DW$T$31, DW_AT_address_class(0x16)
    4666              
    4667              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4668                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    4669              $C$DW$296       .dwtag  DW_TAG_member
    4670                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    4671                      .dwattr $C$DW$296, DW_AT_name("msgID")
    4672                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_msgID")
    4673                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4674                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4675              $C$DW$297       .dwtag  DW_TAG_member
    4676                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    4677                      .dwattr $C$DW$297, DW_AT_name("msgIDMask")
    4678                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_msgIDMask")
    4679                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4680                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4681              $C$DW$298       .dwtag  DW_TAG_member
    4682                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    4683                      .dwattr $C$DW$298, DW_AT_name("flags")
    4684                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_flags")
    4685                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4686                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4687              $C$DW$299       .dwtag  DW_TAG_member
    4688                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    4689                      .dwattr $C$DW$299, DW_AT_name("msgLen")
    4690                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_msgLen")
    4691                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4692                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4693              $C$DW$300       .dwtag  DW_TAG_member
    4694                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$22)
    4695                      .dwattr $C$DW$300, DW_AT_name("msgData")
TMS320C2000 Assembler PC v6.2.9 Tue Jun 09 22:28:35 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0541610                         PAGE   90

    4696                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_msgData")
    4697                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4698                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4699                      .dwendtag $C$DW$T$23
    4700              
    4701              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CAN_MsgObject")
    4702                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$23)
    4703                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    4704              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    4705                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4706                      .dwattr $C$DW$T$33, DW_AT_address_class(0x16)
    4707              
    4708              $C$DW$T$34      .dwtag  DW_TAG_subroutine_type
    4709                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4710              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    4711                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4712                      .dwattr $C$DW$T$35, DW_AT_address_class(0x16)
    4713              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4714                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4715                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4716                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4717              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4718                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4719                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4720                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4721              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4722                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4723                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4724                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4725              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4726                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4727                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4728                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4729              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4730                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4731                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4732                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4733              $C$DW$T$9       .dwtag  DW_TAG_base_type
    4734                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4735                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4736                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    4737              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    4738                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    4739                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    4740              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    4741                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    4742                      .dwattr $C$DW$T$22, DW_AT_address_class(0x16)
    4743              $C$DW$301       .dwtag  DW_TAG_TI_far_type
    4744                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$21)
    4745              $C$DW$T$53      .dwtag  DW_TAG_const_type
    4746                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$301)
    4747              
    4748              $C$DW$T$54      .dwtag  DW_TAG_array_type
    4749                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    4750                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.9 Tue Jun 09 22:28:35 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0541610                         PAGE   91

