TMS320C2000 Assembler PC v6.4.4 Tue Feb 14 14:43:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0221343\AppData\Local\Temp\1022010                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.4 *
       3              ;* Date/Time created: Tue Feb 14 14:43:10 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/Users/a0221343/Git/bootROM/f28004x_bootrom/F28004x_ROM_dev_PG2.0/F28
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.4 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\a0221343\Git\bootROM\f28004x_bootrom\F28004x_ROM_dev_PG2.0
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__byte")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("___byte")

    3567                      .dwpsn  file "C:/Users/a0221343/Git/bootROM/f28004x_bootrom/F28004x_ROM_dev_PG2.0/F28004x_ROM/driverl
    3568 00000011 FE84          SUBB      SP,#4                 ; [CPU_U] 
    3569                      .dwcfi  cfa_offset, -2
    3570              $C$DW$243       .dwtag  DW_TAG_TI_branch
    3571                      .dwattr $C$DW$243, DW_AT_low_pc(0x00)
    3572                      .dwattr $C$DW$243, DW_AT_TI_return
    3573 00000012 0006          LRETR     ; [CPU_] 
TMS320C2000 Assembler PC v6.4.4 Tue Feb 14 14:43:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0221343\AppData\Local\Temp\1022010                         PAGE   67

    3574                      ; return occurs ; [] 
    3575                      .dwattr $C$DW$238, DW_AT_TI_end_file("C:/Users/a0221343/Git/bootROM/f28004x_bootrom/F28004x_ROM_dev_P
    3576                      .dwattr $C$DW$238, DW_AT_TI_end_line(0x653)
    3577                      .dwattr $C$DW$238, DW_AT_TI_end_column(0x01)
    3578                      .dwendentry
    3579                      .dwendtag $C$DW$238
    3580              
    3581              
    3582              ;***************************************************************
    3583              ;* TYPE INFORMATION                                            *
    3584              ;***************************************************************
    3585              
    3586              $C$DW$T$21      .dwtag  DW_TAG_enumeration_type
    3587                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    3588              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_MODE_LIN_SLAVE"), DW_AT_const_value(0x00)
    3589              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_MODE_LIN_MASTER"), DW_AT_const_value(0x20)
    3590                      .dwendtag $C$DW$T$21
    3591              
    3592              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("LIN_LINMode")
    3593                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    3594                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    3595              
    3596              $C$DW$T$23      .dwtag  DW_TAG_enumeration_type
    3597                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    3598              $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_COMM_LIN_USELENGTHVAL"), DW_AT_const_value(0x00)
    3599              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_COMM_LIN_ID4ID5LENCTL"), DW_AT_const_value(0x01)
    3600              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_COMM_SCI_IDLELINE"), DW_AT_const_value(0x00)
    3601              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_COMM_SCI_ADDRBIT"), DW_AT_const_value(0x01)
    3602                      .dwendtag $C$DW$T$23
    3603              
    3604              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("LIN_CommMode")
    3605                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    3606                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3607              
    3608              $C$DW$T$25      .dwtag  DW_TAG_enumeration_type
    3609                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    3610              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_LOOPBACK_DIGITAL"), DW_AT_const_value(0x00)
    3611              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_LOOPBACK_ANALOG"), DW_AT_const_value(0x02)
    3612                      .dwendtag $C$DW$T$25
    3613              
    3614              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("LIN_LoopbackType")
    3615                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    3616                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    3617              
    3618              $C$DW$T$27      .dwtag  DW_TAG_enumeration_type
    3619                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    3620              $C$DW$252       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_CONFIG_INITIAL_VALUE"), DW_AT_const_value(0x00)
    3621              $C$DW$253       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_CONFIG_CURRENT_VALUE"), DW_AT_const_value(0x01)
    3622                      .dwendtag $C$DW$T$27
    3623              
    3624              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("LIN_ConfigValue")
    3625                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3626                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3627              
    3628              $C$DW$T$29      .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v6.4.4 Tue Feb 14 14:43:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0221343\AppData\Local\Temp\1022010                         PAGE   68

    3629                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    3630              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_INTERRUPT_LINE0"), DW_AT_const_value(0x00)
    3631              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_INTERRUPT_LINE1"), DW_AT_const_value(0x01)
    3632                      .dwendtag $C$DW$T$29
    3633              
    3634              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("LIN_InterruptLine")
    3635                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3636                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3637              
    3638              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3639                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x1e)
    3640              $C$DW$256       .dwtag  DW_TAG_member
    3641                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    3642                      .dwattr $C$DW$256, DW_AT_name("CONFIG_GCR0")
    3643                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_CONFIG_GCR0")
    3644                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3645                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3646              $C$DW$257       .dwtag  DW_TAG_member
    3647                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    3648                      .dwattr $C$DW$257, DW_AT_name("CONFIG_GCR1")
    3649                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_CONFIG_GCR1")
    3650                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3651                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3652              $C$DW$258       .dwtag  DW_TAG_member
    3653                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    3654                      .dwattr $C$DW$258, DW_AT_name("CONFIG_GCR2")
    3655                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_CONFIG_GCR2")
    3656                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3657                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3658              $C$DW$259       .dwtag  DW_TAG_member
    3659                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    3660                      .dwattr $C$DW$259, DW_AT_name("CONFIG_SETINT")
    3661                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_CONFIG_SETINT")
    3662                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3663                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3664              $C$DW$260       .dwtag  DW_TAG_member
    3665                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    3666                      .dwattr $C$DW$260, DW_AT_name("CONFIG_SETINTLVL")
    3667                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_CONFIG_SETINTLVL")
    3668                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3669                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3670              $C$DW$261       .dwtag  DW_TAG_member
    3671                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    3672                      .dwattr $C$DW$261, DW_AT_name("CONFIG_FORMAT")
    3673                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_CONFIG_FORMAT")
    3674                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3675                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3676              $C$DW$262       .dwtag  DW_TAG_member
    3677                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    3678                      .dwattr $C$DW$262, DW_AT_name("CONFIG_BRSR")
    3679                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_CONFIG_BRSR")
    3680                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3681                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3682              $C$DW$263       .dwtag  DW_TAG_member
    3683                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.4 Tue Feb 14 14:43:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0221343\AppData\Local\Temp\1022010                         PAGE   69

    3684                      .dwattr $C$DW$263, DW_AT_name("CONFIG_FUN")
    3685                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_CONFIG_FUN")
    3686                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3687                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3688              $C$DW$264       .dwtag  DW_TAG_member
    3689                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    3690                      .dwattr $C$DW$264, DW_AT_name("CONFIG_DIR")
    3691                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_CONFIG_DIR")
    3692                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3693                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3694              $C$DW$265       .dwtag  DW_TAG_member
    3695                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    3696                      .dwattr $C$DW$265, DW_AT_name("CONFIG_ODR")
    3697                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_CONFIG_ODR")
    3698                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3699                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3700              $C$DW$266       .dwtag  DW_TAG_member
    3701                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    3702                      .dwattr $C$DW$266, DW_AT_name("CONFIG_PD")
    3703                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_CONFIG_PD")
    3704                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3705                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3706              $C$DW$267       .dwtag  DW_TAG_member
    3707                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    3708                      .dwattr $C$DW$267, DW_AT_name("CONFIG_PSL")
    3709                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_CONFIG_PSL")
    3710                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3711                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3712              $C$DW$268       .dwtag  DW_TAG_member
    3713                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    3714                      .dwattr $C$DW$268, DW_AT_name("CONFIG_COMP")
    3715                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_CONFIG_COMP")
    3716                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3717                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3718              $C$DW$269       .dwtag  DW_TAG_member
    3719                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    3720                      .dwattr $C$DW$269, DW_AT_name("CONFIG_MASK")
    3721                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_CONFIG_MASK")
    3722                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3723                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3724              $C$DW$270       .dwtag  DW_TAG_member
    3725                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    3726                      .dwattr $C$DW$270, DW_AT_name("CONFIG_MBRSR")
    3727                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_CONFIG_MBRSR")
    3728                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3729                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3730                      .dwendtag $C$DW$T$20
    3731              
    3732              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("LIN_ConfigReg")
    3733                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$20)
    3734                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3735              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3736                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    3737                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    3738              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
TMS320C2000 Assembler PC v6.4.4 Tue Feb 14 14:43:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0221343\AppData\Local\Temp\1022010                         PAGE   70

    3739                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3740              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3741                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3742                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3743                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3744              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3745                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3746                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3747                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3748              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3749                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3750                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3751                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3752              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3753                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3754                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3755                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3756              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3757                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3758                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3759                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3760              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3761                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3762                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3763                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3764              $C$DW$T$10      .dwtag  DW_TAG_base_type
    3765                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3766                      .dwattr $C$DW$T$10, DW_AT_name("int")
    3767                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    3768              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    3769                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$10)
    3770                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    3771              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    3772                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$10)
    3773                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3774              $C$DW$T$11      .dwtag  DW_TAG_base_type
    3775                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3776                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3777                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    3778              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    3779                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$11)
