TMS320C2000 Assembler PC v6.2.9 Tue Apr 14 13:32:51 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0802410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.9 *
       3              ;* Date/Time created: Tue Apr 14 13:32:48 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/c2000_bootROM/f28004x_bootrom/F28004x_ROM_dev/F28004x_RO
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.9 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\c2000_bootROM\f28004x_bootrom\F28004x_ROM_dev\ccs_fi
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__byte")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("___byte")

    3603                      .dwpsn  file "C:/work/grepos/c2000_bootROM/f28004x_bootrom/F28004x_ROM_dev/F28004x_ROM/driverlib/lin_
    3604 0000037d 9A00          MOVB      AL,#0                 ; [CPU_] |1617| 
    3605 0000037e       $C$L16:    
    3606                      .dwpsn  file "C:/work/grepos/c2000_bootROM/f28004x_bootrom/F28004x_ROM_dev/F28004x_ROM/driverlib/lin_
    3607 0000037e FE84          SUBB      SP,#4                 ; [CPU_U] 
    3608                      .dwcfi  cfa_offset, -2
    3609              $C$DW$243       .dwtag  DW_TAG_TI_branch
    3610                      .dwattr $C$DW$243, DW_AT_low_pc(0x00)
    3611                      .dwattr $C$DW$243, DW_AT_TI_return
    3612 0000037f 0006          LRETR     ; [CPU_] 
    3613                      ; return occurs ; [] 
    3614                      .dwattr $C$DW$238, DW_AT_TI_end_file("C:/work/grepos/c2000_bootROM/f28004x_bootrom/F28004x_ROM_dev/F2
    3615                      .dwattr $C$DW$238, DW_AT_TI_end_line(0x653)
    3616                      .dwattr $C$DW$238, DW_AT_TI_end_column(0x01)
    3617                      .dwendentry
    3618                      .dwendtag $C$DW$238
    3619              
    3620              
    3621              ;***************************************************************
    3622              ;* TYPE INFORMATION                                            *
    3623              ;***************************************************************
    3624              
    3625              $C$DW$T$21      .dwtag  DW_TAG_enumeration_type
    3626                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    3627              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_MODE_LIN_SLAVE"), DW_AT_const_value(0x00)
    3628              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_MODE_LIN_MASTER"), DW_AT_const_value(0x20)
    3629                      .dwendtag $C$DW$T$21
    3630              
    3631              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("LIN_LINMode")
    3632                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    3633                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.9 Tue Apr 14 13:32:51 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0802410                         PAGE   68

    3634              
    3635              $C$DW$T$23      .dwtag  DW_TAG_enumeration_type
    3636                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    3637              $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_COMM_LIN_USELENGTHVAL"), DW_AT_const_value(0x00)
    3638              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_COMM_LIN_ID4ID5LENCTL"), DW_AT_const_value(0x01)
    3639              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_COMM_SCI_IDLELINE"), DW_AT_const_value(0x00)
    3640              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_COMM_SCI_ADDRBIT"), DW_AT_const_value(0x01)
    3641                      .dwendtag $C$DW$T$23
    3642              
    3643              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("LIN_CommMode")
    3644                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    3645                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3646              
    3647              $C$DW$T$25      .dwtag  DW_TAG_enumeration_type
    3648                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    3649              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_LOOPBACK_DIGITAL"), DW_AT_const_value(0x00)
    3650              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_LOOPBACK_ANALOG"), DW_AT_const_value(0x02)
    3651                      .dwendtag $C$DW$T$25
    3652              
    3653              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("LIN_LoopbackType")
    3654                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    3655                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    3656              
    3657              $C$DW$T$27      .dwtag  DW_TAG_enumeration_type
    3658                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    3659              $C$DW$252       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_CONFIG_INITIAL_VALUE"), DW_AT_const_value(0x00)
    3660              $C$DW$253       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_CONFIG_CURRENT_VALUE"), DW_AT_const_value(0x01)
    3661                      .dwendtag $C$DW$T$27
    3662              
    3663              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("LIN_ConfigValue")
    3664                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3665                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3666              
    3667              $C$DW$T$29      .dwtag  DW_TAG_enumeration_type
    3668                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    3669              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_INTERRUPT_LINE0"), DW_AT_const_value(0x00)
    3670              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("LIN_INTERRUPT_LINE1"), DW_AT_const_value(0x01)
    3671                      .dwendtag $C$DW$T$29
    3672              
    3673              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("LIN_InterruptLine")
    3674                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3675                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3676              
    3677              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3678                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x1e)
    3679              $C$DW$256       .dwtag  DW_TAG_member
    3680                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    3681                      .dwattr $C$DW$256, DW_AT_name("CONFIG_GCR0")
    3682                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_CONFIG_GCR0")
    3683                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3684                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3685              $C$DW$257       .dwtag  DW_TAG_member
    3686                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    3687                      .dwattr $C$DW$257, DW_AT_name("CONFIG_GCR1")
    3688                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_CONFIG_GCR1")
TMS320C2000 Assembler PC v6.2.9 Tue Apr 14 13:32:51 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0802410                         PAGE   69

    3689                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3690                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3691              $C$DW$258       .dwtag  DW_TAG_member
    3692                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    3693                      .dwattr $C$DW$258, DW_AT_name("CONFIG_GCR2")
    3694                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_CONFIG_GCR2")
    3695                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3696                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3697              $C$DW$259       .dwtag  DW_TAG_member
    3698                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    3699                      .dwattr $C$DW$259, DW_AT_name("CONFIG_SETINT")
    3700                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_CONFIG_SETINT")
    3701                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3702                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3703              $C$DW$260       .dwtag  DW_TAG_member
    3704                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    3705                      .dwattr $C$DW$260, DW_AT_name("CONFIG_SETINTLVL")
    3706                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_CONFIG_SETINTLVL")
    3707                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3708                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3709              $C$DW$261       .dwtag  DW_TAG_member
    3710                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    3711                      .dwattr $C$DW$261, DW_AT_name("CONFIG_FORMAT")
    3712                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_CONFIG_FORMAT")
    3713                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3714                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3715              $C$DW$262       .dwtag  DW_TAG_member
    3716                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    3717                      .dwattr $C$DW$262, DW_AT_name("CONFIG_BRSR")
    3718                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_CONFIG_BRSR")
    3719                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3720                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3721              $C$DW$263       .dwtag  DW_TAG_member
    3722                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    3723                      .dwattr $C$DW$263, DW_AT_name("CONFIG_FUN")
    3724                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_CONFIG_FUN")
    3725                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3726                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3727              $C$DW$264       .dwtag  DW_TAG_member
    3728                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    3729                      .dwattr $C$DW$264, DW_AT_name("CONFIG_DIR")
    3730                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_CONFIG_DIR")
    3731                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3732                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3733              $C$DW$265       .dwtag  DW_TAG_member
    3734                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    3735                      .dwattr $C$DW$265, DW_AT_name("CONFIG_ODR")
    3736                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_CONFIG_ODR")
    3737                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3738                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3739              $C$DW$266       .dwtag  DW_TAG_member
    3740                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    3741                      .dwattr $C$DW$266, DW_AT_name("CONFIG_PD")
    3742                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_CONFIG_PD")
    3743                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C2000 Assembler PC v6.2.9 Tue Apr 14 13:32:51 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0802410                         PAGE   70

    3744                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3745              $C$DW$267       .dwtag  DW_TAG_member
    3746                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    3747                      .dwattr $C$DW$267, DW_AT_name("CONFIG_PSL")
    3748                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_CONFIG_PSL")
    3749                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3750                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3751              $C$DW$268       .dwtag  DW_TAG_member
    3752                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    3753                      .dwattr $C$DW$268, DW_AT_name("CONFIG_COMP")
    3754                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_CONFIG_COMP")
    3755                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3756                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3757              $C$DW$269       .dwtag  DW_TAG_member
    3758                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    3759                      .dwattr $C$DW$269, DW_AT_name("CONFIG_MASK")
    3760                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_CONFIG_MASK")
    3761                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3762                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3763              $C$DW$270       .dwtag  DW_TAG_member
    3764                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    3765                      .dwattr $C$DW$270, DW_AT_name("CONFIG_MBRSR")
    3766                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_CONFIG_MBRSR")
    3767                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3768                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3769                      .dwendtag $C$DW$T$20
    3770              
    3771              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("LIN_ConfigReg")
    3772                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$20)
    3773                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3774              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3775                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    3776                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    3777              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3778                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3779                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3780                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3781              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3782                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3783                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3784                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3785              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3786                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3787                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3788                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3789              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3790                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3791                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3792                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3793              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3794                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3795                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3796                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3797              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    3798                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$8)
TMS320C2000 Assembler PC v6.2.9 Tue Apr 14 13:32:51 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0802410                         PAGE   71

    3799                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3800              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3801                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3802                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3803                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3804              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    3805                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$9)
    3806                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3807              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    3808                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$36)
    3809                      .dwattr $C$DW$T$42, DW_AT_address_class(0x16)
    3810              $C$DW$271       .dwtag  DW_TAG_TI_far_type
    3811                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$42)
    3812              $C$DW$T$44      .dwtag  DW_TAG_const_type
    3813                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$271)
    3814              $C$DW$T$10      .dwtag  DW_TAG_base_type
    3815                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3816                      .dwattr $C$DW$T$10, DW_AT_name("int")
    3817                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    3818              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    3819                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$10)
